/* 1) Манипуляции над DOM

Нужно найти элементы и их модифицировать

// Item 1 - ищем по классу и добавляем дочерний элемент 
//const item1 = ?

Item 2 - ищем по ид и меняем текст внутри на "Item2"
//const item2 = ?

Item 3 - ищем по дата аттрибуту и меняем его фоновый цвет на красный
//const item3 = ?

Item 4 - ищем по тегу и добавляем класс 'blinking'
//const item4 = ?

*/

/* ------------------------------ */


/* 2) Events

Нужно найти элементы и их модифицировать

const nodesTask2 = document.querySelectorAll('.task2')

// event 1 - добавляем событие клик и по клику меняем текст на event1

const eventNode1 = nodesTask2[0]

// event 2 - событие на ввод поля инпут, при вводе должен сменить цвет фона на красный

const eventNode2 = nodesTask2[1]

// event 3 - добавляем смену цвета при скролле на желтый

const eventNode3 = nodesTask2[2]


event 4 - добавляем смену фона боди по нажанию на кнопку b на красный. На другие клавиши - черный

*/


/* НИЖЕ СПОЙЛЕР!!!!!!!!!!!!!!!!!!!!!!! */
/* НИЖЕ СПОЙЛЕР!!!!!!!!!!!!!!!!!!!!!!! */
/* НИЖЕ СПОЙЛЕР!!!!!!!!!!!!!!!!!!!!!!! */
/* НИЖЕ СПОЙЛЕР!!!!!!!!!!!!!!!!!!!!!!! */
/* НИЖЕ СПОЙЛЕР!!!!!!!!!!!!!!!!!!!!!!! */
/* НИЖЕ СПОЙЛЕР!!!!!!!!!!!!!!!!!!!!!!! */
/* НИЖЕ СПОЙЛЕР!!!!!!!!!!!!!!!!!!!!!!! */
/* НИЖЕ СПОЙЛЕР!!!!!!!!!!!!!!!!!!!!!!! */
/* НИЖЕ СПОЙЛЕР!!!!!!!!!!!!!!!!!!!!!!! */
/* НИЖЕ СПОЙЛЕР!!!!!!!!!!!!!!!!!!!!!!! */
/* НИЖЕ СПОЙЛЕР!!!!!!!!!!!!!!!!!!!!!!! */
/* НИЖЕ СПОЙЛЕР!!!!!!!!!!!!!!!!!!!!!!! */
/* НИЖЕ СПОЙЛЕР!!!!!!!!!!!!!!!!!!!!!!! */
/* НИЖЕ СПОЙЛЕР!!!!!!!!!!!!!!!!!!!!!!! */
/* НИЖЕ СПОЙЛЕР!!!!!!!!!!!!!!!!!!!!!!! */
/* НИЖЕ СПОЙЛЕР!!!!!!!!!!!!!!!!!!!!!!! */
/* НИЖЕ СПОЙЛЕР!!!!!!!!!!!!!!!!!!!!!!! */
/* НИЖЕ СПОЙЛЕР!!!!!!!!!!!!!!!!!!!!!!! */
/* НИЖЕ СПОЙЛЕР!!!!!!!!!!!!!!!!!!!!!!! */
/* НИЖЕ СПОЙЛЕР!!!!!!!!!!!!!!!!!!!!!!! */
/* НИЖЕ СПОЙЛЕР!!!!!!!!!!!!!!!!!!!!!!! */
/* НИЖЕ СПОЙЛЕР!!!!!!!!!!!!!!!!!!!!!!! */
/* НИЖЕ СПОЙЛЕР!!!!!!!!!!!!!!!!!!!!!!! */
/* НИЖЕ СПОЙЛЕР!!!!!!!!!!!!!!!!!!!!!!! */
/* НИЖЕ СПОЙЛЕР!!!!!!!!!!!!!!!!!!!!!!! */
/* НИЖЕ СПОЙЛЕР!!!!!!!!!!!!!!!!!!!!!!! */
/* НИЖЕ СПОЙЛЕР!!!!!!!!!!!!!!!!!!!!!!! */
/* НИЖЕ СПОЙЛЕР!!!!!!!!!!!!!!!!!!!!!!! */
/* НИЖЕ СПОЙЛЕР!!!!!!!!!!!!!!!!!!!!!!! */
/* НИЖЕ СПОЙЛЕР!!!!!!!!!!!!!!!!!!!!!!! */
/* НИЖЕ СПОЙЛЕР!!!!!!!!!!!!!!!!!!!!!!! */
/* НИЖЕ СПОЙЛЕР!!!!!!!!!!!!!!!!!!!!!!! */
/* НИЖЕ СПОЙЛЕР!!!!!!!!!!!!!!!!!!!!!!! */
/* НИЖЕ СПОЙЛЕР!!!!!!!!!!!!!!!!!!!!!!! */
/* НИЖЕ СПОЙЛЕР!!!!!!!!!!!!!!!!!!!!!!! */
/* НИЖЕ СПОЙЛЕР!!!!!!!!!!!!!!!!!!!!!!! */
/* НИЖЕ СПОЙЛЕР!!!!!!!!!!!!!!!!!!!!!!! */
/* НИЖЕ СПОЙЛЕР!!!!!!!!!!!!!!!!!!!!!!! */
/* НИЖЕ СПОЙЛЕР!!!!!!!!!!!!!!!!!!!!!!! */
/* НИЖЕ СПОЙЛЕР!!!!!!!!!!!!!!!!!!!!!!! */
/* НИЖЕ СПОЙЛЕР!!!!!!!!!!!!!!!!!!!!!!! */
/* НИЖЕ СПОЙЛЕР!!!!!!!!!!!!!!!!!!!!!!! */
/* НИЖЕ СПОЙЛЕР!!!!!!!!!!!!!!!!!!!!!!! */
/* НИЖЕ СПОЙЛЕР!!!!!!!!!!!!!!!!!!!!!!! */
/* НИЖЕ СПОЙЛЕР!!!!!!!!!!!!!!!!!!!!!!! */
/* НИЖЕ СПОЙЛЕР!!!!!!!!!!!!!!!!!!!!!!! */
/* НИЖЕ СПОЙЛЕР!!!!!!!!!!!!!!!!!!!!!!! */
/* НИЖЕ СПОЙЛЕР!!!!!!!!!!!!!!!!!!!!!!! */
/* НИЖЕ СПОЙЛЕР!!!!!!!!!!!!!!!!!!!!!!! */
/* НИЖЕ СПОЙЛЕР!!!!!!!!!!!!!!!!!!!!!!! */
/* НИЖЕ СПОЙЛЕР!!!!!!!!!!!!!!!!!!!!!!! */
/* НИЖЕ СПОЙЛЕР!!!!!!!!!!!!!!!!!!!!!!! */
/* НИЖЕ СПОЙЛЕР!!!!!!!!!!!!!!!!!!!!!!! */
/* НИЖЕ СПОЙЛЕР!!!!!!!!!!!!!!!!!!!!!!! */
/* НИЖЕ СПОЙЛЕР!!!!!!!!!!!!!!!!!!!!!!! */
/* НИЖЕ СПОЙЛЕР!!!!!!!!!!!!!!!!!!!!!!! */
/* НИЖЕ СПОЙЛЕР!!!!!!!!!!!!!!!!!!!!!!! */
/* НИЖЕ СПОЙЛЕР!!!!!!!!!!!!!!!!!!!!!!! */
/* НИЖЕ СПОЙЛЕР!!!!!!!!!!!!!!!!!!!!!!! */
/* НИЖЕ СПОЙЛЕР!!!!!!!!!!!!!!!!!!!!!!! */
/* ------------------------------ */
/* ------------------------------ */
/* ------------------------------ */
/* ------------------------------ */
/* ------------------------------ */
/* ------------------------------ */
/* ------------------------------ */
/* ------------------------------ */
/* ------------------------------ */
/* ------------------------------ */
/* ------------------------------ */
/* ------------------------------ */
/* ------------------------------ */
/* ------------------------------ */
/* ------------------------------ */
/* ------------------------------ */
/* ------------------------------ */
/* ------------------------------ */
/* ------------------------------ */
/* ------------------------------ */
/* ------------------------------ */
/* ------------------------------ */
/* ------------------------------ */
/* ------------------------------ */
/* ------------------------------ */
/* ------------------------------ */
/* ------------------------------ */
/* ------------------------------ */
/* ------------------------------ */
/* ------------------------------ */
/* ------------------------------ */
/* ------------------------------ */
/* ------------------------------ */
/* ------------------------------ */
/* ------------------------------ */
/* ------------------------------ */
/* ------------------------------ */
/* ------------------------------ */
/* ------------------------------ */
/* ------------------------------ */
/* ------------------------------ */
/* ------------------------------ */
/* ------------------------------ */
/* ------------------------------ */
/* ------------------------------ */
/* ------------------------------ */
/* ------------------------------ */
/* ------------------------------ */
/* ------------------------------ */
/* ------------------------------ */
/* ------------------------------ */
/* ------------------------------ */
/* ------------------------------ */
/* ------------------------------ */
/* ------------------------------ */
/* ------------------------------ */
/* ------------------------------ */
/* ------------------------------ */
/* ------------------------------ */
/* ------------------------------ */
/* ------------------------------ */
/* ------------------------------ */
/* ------------------------------ */
/* ------------------------------ */
/* ------------------------------ */
/* ------------------------------ */
/* ------------------------------ */
/* ------------------------------ */
/* ------------------------------ */
/* ------------------------------ */
/* ------------------------------ */




/* 1) Манипуляции над DOM

Нужно найти элементы и их модифицировать

Item 1 - ищем по классу и добавляем дочерний элемент  (<div> с текстом children и классом children)

Item 2 - ищем по ид и меняем текст внутри на "Item2"

Item 3 - ищем по дата аттрибуту и меняем его фоновый цвет на красный

Item 4 - ищем по тегу и добавляем класс 'blinking'

*/

// Item 1 - ищем по классу и добавляем дочерний элемент

const item1 = document.getElementsByClassName('item1')[0]
const children = document.createElement('div')
children.textContent = 'children'
children.className = 'children'

item1.append(children)


// Item 2 - ищем по ид и меняем текст внутри на "Item2"

const item2 = document.getElementById('item2')
item2.textContent = 'Item2'

// Item 3 - ищем по дата аттрибуту и меняем его фоновый цвет на красный
const item3 = document.querySelector('[data-id]')
item3.style.background = 'red'

// Item 4 - ищем по тегу и добавляем класс 'blinking'
const item4 = document.getElementsByTagName('span')
item4[0].classList.add('blinking')



/* 2) Events

Нужно найти элементы и их модифицировать

event 1 - добавляем событие клик и по клику меняем текст на event1

event 2 - событие на ввод поля инпут, при вводе должен сменить цвет фона на красный

event 3 - добавляем смену цвета при скролле на желтый

event 4 - добавляем смену фона боди по нажанию на кнопку b на красный. На другие клавиши - черный

*/

const nodesTask2 = document.querySelectorAll('.task2')

const eventNode1 = nodesTask2[0]

eventNode1.addEventListener('click', (e) => {
    e.target.textContent = 'event1'
})


const eventNode2 = nodesTask2[1]

eventNode2.addEventListener('input', (e) => {
    e.target.style.background = 'red'
})


const eventNode3 = nodesTask2[2]

eventNode3.addEventListener('scroll', (e) => {
    e.target.style.background = "yellow"
})



document.body.addEventListener('keydown', (e) => {
    if(e.key === 'b') {
        document.body.style.background = 'red'
    } else {
        document.body.style.background = 'black'
    }
})